08-02-aplicacao.org
#+setupfile: static/setupfile.org
#+html_link_up: 08-interpretador.html
#+title: Aplicação
#+startup: content

#+property: header-args:rust :tangle src/evaluator/application.rs

Arquivo: ~evaluator/application.rs~

#+begin_src rust
use gc::Gc;
use crate::{
    maj_list,
    core::{ Maj, MajState },
    axioms::{
        predicates::*,
        primitives::*
    },
};

use crate::axioms::utils::{
    STACK_RED_ZONE,
    STACK_PER_RECURSION
};

use super::maj_eval;
#+end_src

** TODO Aplicação genérica

- Uma /primitiva/ pode ser despachada para a aplicação de primitivas;
- Um /macro/  deverá ser aplicado  como um procedimento normal,  mas seu
  resultado deve ser /interpretado/ logo em seguida;
- Uma /clausura/  deverá ser  aplicada a  seus argumentos.  Isso envolve
  processos mais  complexos como /currying/ e  desestruturação, portanto
  esse processo deverá ser delegado para sua própria função;
- Caso nenhuma  das situações se  encaixe, então teremos uma  falha de
  aplicação desconhecida.

#+index: apply

#+begin_src rust
pub fn maj_apply(
    mut state: &mut MajState,
    fun: Gc<Maj>,
    args: Gc<Maj>,
    env: Gc<Maj>
) -> Gc<Maj> {
    // primitives
    if maj_primitivep(fun.clone()).to_bool() {
        let name = maj_car(maj_cdr(maj_cdr(fun)));
        apply_primitive(&mut state, name, args, env)
    }

    // closure
    else if maj_closurep(fun.clone()).to_bool() {
        maj_apply_closure(&mut state, fun, args, env)
    }

    // macro
    else if maj_macrop(fun.clone()).to_bool() {
        let (expr, can_evaluate) =
            expand_macro(&mut state, fun, args,
                         env.clone());
        if can_evaluate {
            stacker::maybe_grow(
                STACK_RED_ZONE,
                STACK_PER_RECURSION,
                || maj_eval(&mut state, expr, env))
        } else {
            // Error
            expr
        }
    }

    // otherwise, fail
    else {
        maj_err(
            Maj::string("Cannot apply {} to args {}"),
            maj_list!(fun, args))
    }
}
#+end_src

