08-02-aplicacao.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-23 dom 23:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Aplicação</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="08-interpretador.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Aplicação</h1>
<p>
Arquivo: <code>evaluator/application.rs</code>
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">gc</span>::<span style="color: #4ec9b0;">Gc</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::{
    maj_list,
    <span style="color: #569cd6;">core</span>::{ <span style="color: #4ec9b0;">Maj</span>, <span style="color: #4ec9b0;">MajState</span> },
    <span style="color: #569cd6;">axioms</span>::{
        <span style="color: #569cd6;">predicates</span>::*,
        <span style="color: #569cd6;">primitives</span>::*
    },
};

<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">utils</span>::{
    <span style="color: #4ec9b0;">STACK_RED_ZONE</span>,
    <span style="color: #4ec9b0;">STACK_PER_RECURSION</span>
};

<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">super</span>::maj_eval;
</pre>
</div>

<div id="outline-container-org52e7ebd" class="outline-2">
<h2 id="org52e7ebd"><span class="section-number-2">1.</span> <span class="todo TODO">TODO</span> Aplicação genérica</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Uma <i>primitiva</i> pode ser despachada para a aplicação de primitivas;</li>
<li>Um <i>macro</i>  deverá ser aplicado  como um procedimento normal,  mas seu
resultado deve ser <i>interpretado</i> logo em seguida;</li>
<li>Uma <i>clausura</i>  deverá ser  aplicada a  seus argumentos.  Isso envolve
processos mais  complexos como <i>currying</i> e  desestruturação, portanto
esse processo deverá ser delegado para sua própria função;</li>
<li>Caso nenhuma  das situações se  encaixe, então teremos uma  falha de
aplicação desconhecida.</li>
</ul>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_apply</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">fun</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">args</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">primitives</span>
    <span style="color: #569cd6;">if</span> maj_primitivep(fun.clone()).to_bool() {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">name</span> = maj_car(maj_cdr(maj_cdr(fun)));
        apply_primitive(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, name, args, env)
    }

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">closure</span>
    <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_closurep(fun.clone()).to_bool() {
        maj_apply_closure(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, fun, args, env)
    }

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">macro</span>
    <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_macrop(fun.clone()).to_bool() {
        <span style="color: #569cd6;">let</span> (expr, can_evaluate) =
            expand_macro(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, fun, args,
                         env.clone());
        <span style="color: #569cd6;">if</span> can_evaluate {
            <span style="color: #569cd6;">stacker</span>::maybe_grow(
                <span style="color: #4ec9b0;">STACK_RED_ZONE</span>,
                <span style="color: #4ec9b0;">STACK_PER_RECURSION</span>,
                || maj_eval(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, expr, env))
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Error</span>
            expr
        }
    }

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">otherwise, fail</span>
    <span style="color: #569cd6;">else</span> {
        maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Cannot apply {} to args {}"</span>),
            <span style="color: #c586c0;">maj_list!</span>(fun, args))
    }
}
</pre>
</div>
</div>
</div>
