08-02-aplicacao.html

<div id="outline-container-orged19ac3" class="outline-2">
<h2 id="orged19ac3"><span class="section-number-2">2.</span> <span class="todo TODO">TODO</span> Aplicação de clausuras</h2>
<div class="outline-text-2" id="text-2">
<p>
A  aplicação de  uma clausura  em  uma lista  de argumentos  é um  dos
processos-chave  da interpretação  da  linguagem.  Aqui, tomamos  como
argumento  a  clausura  em  si,  que chamamos  <code>fun</code>,  e  uma  lista  de
argumentos <i>que já tenham sido interpretados</i>  &#x2013; a essa lista daremos o
nome <code>args</code>.
</p>

<p>
Primeiramente, verificamos se <code>fun</code> é uma clausura <i>válida</i> &#x2013; não por ser
um  literal  designando clausura,  mas  por  ser  uma lista  de  cinco
elementos.
</p>

<p>
Podemos relembrar que uma clausura possui a sintaxe
</p>

<pre class="example" id="org6b3b9ea">
(lit closure &lt;env&gt; &lt;lambda-list&gt; (&lt;body&gt;))
</pre>

<p>
Recuperamos o contexto  capturado pela função (<code>env</code>),  a lista<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> de
símbolos que designam os argumentos  da função (<code>lambda-list</code>) e o corpo
da função a ser interpretado (<code>body</code>).
</p>

<p>
O corpo  da função pode  possuir uma  ou mais expressões,  portanto, é
necessário  "corrigi-lo"  antes  da aplicação,  adicionando-se  um  <code>do</code>
implícito.
</p>

<p>
Se a <i>quantidade de argumentos fornecidos</i> for nula quando a função pede
um número de argumentos superior a  zero, lançamos um erro. Isso evita
uma possível aplicação parcial com zero argumentos.
</p>

<p>
A  seguir, fazemos  <i>ligações</i> entre  os  símbolos da  <code>lambda-list</code> e  os
argumentos, até onde  for possível, tomando o  contexto capturado como
base.  Caso ainda  sobre  algum  símbolo para  ser  <i>ligado</i>, isso  será
indicativo de que estamos tratando de <i>aplicação parcial</i>.
</p>

<p>
Se  o processo  de <i>ligação</i>  apresentar um  erro no  lugar do  contexto
extendido, interrompemos a aplicação imediatamente e retornamo-no.
</p>

<p>
Logo  após, tratamos  a <i>aplicação  parcial</i>. Se  a lista  de argumentos
ainda não-ligados  não for  <i>vazia</i>, então retornamos  imediatamente uma
nova  clausura,  gerada <i>ad-hoc</i>:  o  <i>contexto</i>  capturado  por ela  é  o
<i>contexto extendido</i>,  a <i>lista de  argumentos</i> da clausura  será composta
pelos exatos mesmos argumentos que não  foram ligados, na ordem em que
apareciam originalmente. O corpo da função continuará sendo o mesmo.
</p>

<p>
Por  fim, a  aplicação total  de  uma função  representa uma  operação
simples:  basta  interpretar o  <i>corpo</i>  da  função, usando  o  <i>contexto
extendido</i>  pelo processo  de ligação  dos argumentos  aos símbolos  da
<code>lambda-list</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_apply_closure</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">fun</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">args</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">lexenv</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">environment</span>::maj_env_union;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">length</span> = maj_length(fun.clone()).to_integer().unwrap();
    <span style="color: #569cd6;">if</span> length != 5 {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Invalid syntax: {}"</span>),
            <span style="color: #c586c0;">maj_list!</span>(fun));
    }
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit closure &lt;env&gt; lambda-list . body)</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">env</span> = maj_car(maj_cdr(maj_cdr(fun.clone())));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">lambda_list</span> =
        maj_car(maj_cdr(maj_cdr(maj_cdr(fun.clone()))));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">body</span> =
        maj_car(maj_cdr(maj_cdr(maj_cdr(maj_cdr(fun.clone())))));

    <span style="color: #569cd6;">if</span> maj_nilp(args.clone()).to_bool() &amp;&amp;
        !maj_nilp(lambda_list.clone()).to_bool() {
            <span style="color: #569cd6;">return</span> maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(
                    <span style="color: #ce9178;">"Cannot curry function without arguments"</span>),
                <span style="color: #4ec9b0;">Maj</span>::nil());
        }

    <span style="color: #569cd6;">if</span> maj_consp(lambda_list.clone()).to_bool() &amp;&amp;
    maj_proper_list_p(lambda_list.clone()).to_bool() {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">ll_len</span>   = maj_length(lambda_list.clone())
            .to_integer();
        <span style="color: #569cd6;">match</span> ll_len {
            <span style="color: #4ec9b0;">Some</span>(ll_len) =&gt; {
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">args_len</span> = maj_length(args.clone())
                    .to_integer()
                    .unwrap();
                <span style="color: #569cd6;">if</span> args_len &gt; ll_len {
                    <span style="color: #569cd6;">return</span> maj_err(<span style="color: #4ec9b0;">Maj</span>::string(
                        <span style="color: #ce9178;">"Too many arguments in function call"</span>),
                                   <span style="color: #4ec9b0;">Maj</span>::nil());
                }
            },
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Dotted list</span>
            <span style="color: #4ec9b0;">None</span> =&gt; {},
        }
    }

    <span style="color: #569cd6;">let</span> (uargs, extenv) = maj_bind(lambda_list, args, env.clone());

    <span style="color: #569cd6;">if</span> maj_errorp(extenv.clone()).to_bool() {
        env
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> !maj_nilp(uargs.clone()).to_bool() {
        <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(),
                  <span style="color: #4ec9b0;">Maj</span>::closure(),
                  extenv,
                  uargs,
                  body)
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Implicit `do`</span>
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">body</span> = <span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::do_sym(), body);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Unite extended environment with lexical environment</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(on evaluation only)</span>
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">extenv</span> = maj_env_union(extenv, lexenv);
        maj_eval(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, body, extenv)
    }
}
</pre>
</div>

<p>
A função a seguir realiza o  processo genérico de <i>ligação</i> dos símbolos
da <code>lambda-list</code> aos <i>argumentos</i>.
</p>

<p>
Essa função opera de forma recursiva, e retorna dois valores:
</p>

<ol class="org-ol">
<li>Uma lista de símbolos <i>não-ligados</i> na <code>lambda-list</code>, caso existam;</li>
<li>O novo contexto após sua extensão, <b>ou</b> um objeto de erro.</li>
</ol>

<p>
Essa função também  é responsável pelo processo  de <i>desestruturação</i> de
argumentos, quando  a <code>lambda-list</code>  possui sub-listas. Esse  processo é
delegado a outra função que veremos a seguir.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_bind</span>(
    <span style="color: #9cdcfe;">lambda_list</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">args</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; (<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">environment</span>::maj_env_push;

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">-1. lambda_list is nil.</span>
    <span style="color: #569cd6;">if</span> maj_nilp(lambda_list.clone()).to_bool() {
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">-1.1. If (not (nilp args)), then error</span>
        <span style="color: #569cd6;">if</span> !maj_nilp(args.clone()).to_bool() {
            <span style="color: #569cd6;">return</span>
                (<span style="color: #4ec9b0;">Maj</span>::nil(),
                 maj_err(
                     <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Arguments {} exceeded lambda-list"</span>),
                     <span style="color: #c586c0;">maj_list!</span>(args.clone())));
        }
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">-1.X. Otherwise, return (lambda_list, env).</span>
        <span style="color: #6a9955;">//      </span><span style="color: #6a9955;">Everything is already bound.</span>
        <span style="color: #569cd6;">else</span> {
            <span style="color: #569cd6;">return</span> (lambda_list, env);
        }
    }
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">0. args is nil.</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">0.1. Return (lambda_list, env) as well.</span>
    <span style="color: #6a9955;">//      </span><span style="color: #6a9955;">This does currying.</span>
    <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_nilp(args.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> (lambda_list, env);
    }

    <span style="color: #569cd6;">match</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*lambda_list.clone() {
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">1. lambda_list is a cons.</span>
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { car, cdr } =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">extenv</span> =
                <span style="color: #569cd6;">if</span> maj_consp(car.clone()).to_bool() {
                    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">If car is a cons: Do destructuring.</span>
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">newenv</span> =
                        maj_destructuring_bind(car.clone(),
                                               maj_car(args.clone()),
                                               env.clone());
                    <span style="color: #569cd6;">if</span> maj_errorp(newenv.clone()).to_bool() {
                        <span style="color: #569cd6;">return</span> (<span style="color: #4ec9b0;">Maj</span>::nil(), newenv);
                    }
                    newenv
                } <span style="color: #569cd6;">else</span> {
                    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">If car is not a cons: Normal binding.</span>
                    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Bind car to (car args) in the lexenv.</span>
                    maj_env_push(env.clone(),
                                 car.clone(),
                                 maj_car(args.clone()))
                };

            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Recur with extended environment, cdr as</span>
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">lambda_list, (cdr args) as args</span>
            maj_bind(cdr.clone(), maj_cdr(args), extenv)
        },
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">2. lambda_list is a symbol.</span>
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(_) =&gt; {
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">TODO: if (last args) is (&amp;), we need to curry</span>
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">while binding (butlast args) to the symbol.</span>
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Then return the symbol itself as lambda-list.</span>
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">The binding incurs in</span>
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(append (lookup ,symbol) (butlast args)).</span>

            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">If (last args) is not (&amp;),</span>
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Both leave no unbound syms in lambda-list.</span>
            (<span style="color: #4ec9b0;">Maj</span>::nil(),
             maj_env_push(
                 env.clone(),
                 lambda_list,
                 <span style="color: #6a9955;">// </span><span style="color: #6a9955;">2.1. If (not (nilp args)) then bind args</span>
                 <span style="color: #569cd6;">if</span> !maj_nilp(args.clone()).to_bool() {
                     args
                 }
                 <span style="color: #6a9955;">// </span><span style="color: #6a9955;">2.2. If (nilp args) then bind nil</span>
                 <span style="color: #569cd6;">else</span> {
                     <span style="color: #4ec9b0;">Maj</span>::nil()
                 }))
        },
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">X. Otherwise, error. Only cons and symbols allowed.</span>
        _ =&gt; (<span style="color: #4ec9b0;">Maj</span>::nil(),
              maj_err(
                   <span style="color: #4ec9b0;">Maj</span>::string(
                      <span style="color: #ce9178;">"Lambda list can only have symbols or conses"</span>),
                  <span style="color: #4ec9b0;">Maj</span>::nil()))
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_destructuring_bind</span>(<span style="color: #9cdcfe;">list</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                          <span style="color: #9cdcfe;">args</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                          <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">environment</span>::maj_env_push;

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">list_nilp</span> = maj_nilp(list.clone()).to_bool();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">args_nilp</span> = maj_nilp(args.clone()).to_bool();

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Do not allow leftover args</span>
    <span style="color: #569cd6;">if</span> list_nilp &amp;&amp; !args_nilp {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Arguments exceed destructuring pattern"</span>),
            <span style="color: #4ec9b0;">Maj</span>::nil());
    }

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Leftover symbols, though, should bind to nil.</span>
    <span style="color: #569cd6;">if</span> !list_nilp &amp;&amp; args_nilp {
            <span style="color: #569cd6;">return</span> maj_bind_rec_nil(list, env);
    }

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">When both are nil, we are done</span>
    <span style="color: #569cd6;">if</span> list_nilp &amp;&amp; args_nilp {
        <span style="color: #569cd6;">return</span> env;
    }

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">When list is a symbol and args is not, bind list</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">to args and return</span>
    <span style="color: #569cd6;">if</span> !maj_consp(list.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_env_push(env, list, args);
    }

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">When args is a non-nil symbol, fail immediately!</span>
    <span style="color: #569cd6;">if</span> !maj_consp(args.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Cannot destructure atomic value {}"</span>),
            <span style="color: #c586c0;">maj_list!</span>(maj_car(args.clone())));
    }

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Otherwise, there is destructuring to do.</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">sym</span> = maj_car(list.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">arg</span> = maj_car(args.clone());

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">extenv</span> =
        <span style="color: #569cd6;">if</span> maj_consp(sym.clone()).to_bool() {
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">If sym is a cons, recursively destructure</span>
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">it with arg as new environment.</span>
            maj_destructuring_bind(sym, arg, env)
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Otherwise, do an ad-hoc binding to</span>
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">generate the extended environment.</span>
            maj_env_push(env, sym, arg)
        };

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Proceed recursively with new environment</span>
    maj_destructuring_bind(maj_cdr(list),
                           maj_cdr(args),
                           extenv)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_bind_rec_nil</span>(<span style="color: #9cdcfe;">lambda_list</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">environment</span>::maj_env_push;
    <span style="color: #569cd6;">if</span> maj_nilp(lambda_list.clone()).to_bool() {
        <span style="color: #569cd6;">return</span> <span style="color: #4ec9b0;">Maj</span>::nil();
    }

    <span style="color: #569cd6;">match</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*lambda_list.clone() {
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(_) =&gt; {
            maj_env_push(env.clone(),
                         lambda_list.clone(),
                         <span style="color: #4ec9b0;">Maj</span>::nil())
        },
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { car, cdr } =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">extenv</span> = maj_bind_rec_nil(car.clone(), env);
            maj_bind_rec_nil(cdr.clone(), extenv)
        },
        _ =&gt; <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Never try to recursively bind a list with more than symbols and conses"</span>),
    }
}
</pre>
</div>
</div>
</div>
