08-02-aplicacao.org
** TODO Aplicação de macros

#+begin_src rust
pub fn expand_macro(
    mut state: &mut MajState,
    mac: Gc<Maj>,
    args: Gc<Maj>,
    env: Gc<Maj>
) -> (Gc<Maj>, bool) {
    if maj_macrop(mac.clone()).to_bool() {
        // (lit macro <closure>)
        let closure = maj_car(maj_cdr(maj_cdr(mac)));
        let result = maj_apply(&mut state,
                               closure,
                               args.clone(),
                               env);
        if maj_closurep(result.clone()).to_bool() {
            (maj_err(
                Maj::string(
                    "Error expanding macro expression for {}"),
                maj_list!(args)),
             false)
        } else if maj_errorp(result.clone()).to_bool() {
            (result, false)
        } else {
            (result, true)
        }
    } else {
        (Maj::cons(mac, args), false)
    }
}
#+end_src

