08-02-aplicacao.html

<div id="outline-container-orga03e26c" class="outline-2">
<h2 id="orga03e26c"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> Aplicação de macros</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">expand_macro</span>(
    <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">mac</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">args</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;
) -&gt; (<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">bool</span>) {
    <span style="color: #569cd6;">if</span> maj_macrop(mac.clone()).to_bool() {
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit macro &lt;closure&gt;)</span>
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">closure</span> = maj_car(maj_cdr(maj_cdr(mac)));
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> = maj_apply(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                               closure,
                               args.clone(),
                               env);
        <span style="color: #569cd6;">if</span> maj_closurep(result.clone()).to_bool() {
            (maj_err(
                <span style="color: #4ec9b0;">Maj</span>::string(
                    <span style="color: #ce9178;">"Error expanding macro expression for {}"</span>),
                <span style="color: #c586c0;">maj_list!</span>(args)),
             <span style="color: #569cd6;">false</span>)
        } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_errorp(result.clone()).to_bool() {
            (result, <span style="color: #569cd6;">false</span>)
        } <span style="color: #569cd6;">else</span> {
            (result, <span style="color: #569cd6;">true</span>)
        }
    } <span style="color: #569cd6;">else</span> {
        (<span style="color: #4ec9b0;">Maj</span>::cons(mac, args), <span style="color: #569cd6;">false</span>)
    }
}
</pre>
</div>
</div>
</div>
