08-02-aplicacao.org
** TODO Aplicação de primitivas

# This function needs refactoring

#+begin_src rust
pub fn apply_primitive(mut state: &mut MajState,
                       prim: Gc<Maj>,
                       args: Gc<Maj>,
                       env: Gc<Maj>) -> Gc<Maj> {
    use crate::printing::maj_format;
    use crate::axioms::MajPrimArgs;
    let primitive = state.find_primitive(prim.clone());
    match primitive {
        Some((function, arity)) => {
            let argl = maj_length(args.clone())
                .to_integer()
                .unwrap();
            match *arity {
                MajPrimArgs::None => {
                    if argl != 0 {
                        maj_err(
                            Maj::string("{} requires no arguments"),
                            maj_list!(prim))
                    } else {
                        function(&mut state, Maj::nil(), env)
                    }
                },
                MajPrimArgs::Required(n) => {
                    let n = n as i64;
                    if argl < n {
                        // Curry on argl < n && argl != 0.
                        // Delegate to closures
                        curry_primitive(&mut state, prim, n, argl, args, env, false)
                    } else if argl > n {
                        // Fail on argl > n
                        maj_err(
                            Maj::string("Too many arguments for {}"),
                            maj_list!(prim))
                    } else {
                        // Apply on argl = n
                        function(&mut state, args, env)
                    }
                },
                MajPrimArgs::Variadic(n) => {
                    let n = n as i64;
                    // Check for & to account for in argl.
                    let last = maj_last(args.clone());
                    let force_curry = maj_eq(last, Maj::ampersand())
                        .to_bool();
                    let targl = if force_curry { argl - 1 } else { argl };

                    // Normal and variadic currying, respectively
                    if (targl < n && !force_curry) ||
                        (targl > n && force_curry) {
                            // Delegate currying to closures
                            curry_primitive(&mut state, prim, n, targl, args, env, true)
                        } else {
                            function(&mut state, args, env)
                        }
                },
            }
        },
        _ => panic!("Primitive \"{}\" does not exist",
                    maj_format(&state, prim)),
    }
}
#+end_src

#+begin_src rust
fn gen_arglist(mut state: &mut MajState, n: i64, variadicp: bool) -> Gc<Maj> {
    let mut list = if variadicp {
        Maj::symbol(&mut state, "rest")
    } else {
        Maj::nil()
    };

    for _ in 0..n {
        list = Maj::cons(maj_gensym(&mut state),
                         list.clone());
    }
    list
}
#+end_src

#+begin_src rust
fn wrap_primitive(prim: Gc<Maj>,
                  env: Gc<Maj>,
                  arglist: Gc<Maj>) -> Gc<Maj> {
    // (lit closure <env> <arglist> ((<prim> . <arglist>)))
    maj_list!(
        Maj::lit(),
        Maj::closure(),
        env,
        arglist.clone(),
        maj_list!(
            maj_cons(prim, arglist)))
}
#+end_src

#+begin_src rust
fn curry_primitive(mut state: &mut MajState,
                   prim: Gc<Maj>,
                   num_args: i64,
                   num_params: i64,
                   args: Gc<Maj>,
                   env: Gc<Maj>,
                   variadicp: bool) -> Gc<Maj> {
    if num_params == 0 {
        return maj_err(
            Maj::string(
                "Cannot curry function without arguments"),
            Maj::nil());
    }

    // Currying a primitive function involves generating
    // a wrapper closure, then performing simple application.
    let arglist = gen_arglist(&mut state, num_args, variadicp);
    let wrapped = wrap_primitive(prim, env.clone(), arglist);
    maj_apply(&mut state, wrapped, args, env)
}
#+end_src

