08-02-aplicacao.html

<div id="outline-container-org0e4241e" class="outline-2">
<h2 id="org0e4241e"><span class="section-number-2">4.</span> <span class="todo TODO">TODO</span> Aplicação de primitivas</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">apply_primitive</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                       <span style="color: #9cdcfe;">prim</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                       <span style="color: #9cdcfe;">args</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                       <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">printing</span>::maj_format;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #4ec9b0;">MajPrimArgs</span>;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">primitive</span> = state.find_primitive(prim.clone());
    <span style="color: #569cd6;">match</span> primitive {
        <span style="color: #4ec9b0;">Some</span>((function, arity)) =&gt; {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">argl</span> = maj_length(args.clone())
                .to_integer()
                .unwrap();
            <span style="color: #569cd6;">match</span> *arity {
                <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">None</span> =&gt; {
                    <span style="color: #569cd6;">if</span> argl != 0 {
                        maj_err(
                            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} requires no arguments"</span>),
                            <span style="color: #c586c0;">maj_list!</span>(prim))
                    } <span style="color: #569cd6;">else</span> {
                        function(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(), env)
                    }
                },
                <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Required</span>(n) =&gt; {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">n</span> = n <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">i64</span>;
                    <span style="color: #569cd6;">if</span> argl &lt; n {
                        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Curry on argl &lt; n &amp;&amp; argl != 0.</span>
                        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Delegate to closures</span>
                        curry_primitive(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, prim, n, argl, args, env, <span style="color: #569cd6;">false</span>)
                    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> argl &gt; n {
                        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Fail on argl &gt; n</span>
                        maj_err(
                            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Too many arguments for {}"</span>),
                            <span style="color: #c586c0;">maj_list!</span>(prim))
                    } <span style="color: #569cd6;">else</span> {
                        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Apply on argl = n</span>
                        function(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, args, env)
                    }
                },
                <span style="color: #4ec9b0;">MajPrimArgs</span>::<span style="color: #4ec9b0;">Variadic</span>(n) =&gt; {
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">n</span> = n <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">i64</span>;
                    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Check for &amp; to account for in argl.</span>
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">last</span> = maj_last(args.clone());
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">force_curry</span> = maj_eq(last, <span style="color: #4ec9b0;">Maj</span>::ampersand())
                        .to_bool();
                    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">targl</span> = <span style="color: #569cd6;">if</span> force_curry { argl - 1 } <span style="color: #569cd6;">else</span> { argl };

                    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Normal and variadic currying, respectively</span>
                    <span style="color: #569cd6;">if</span> (targl &lt; n &amp;&amp; !force_curry) ||
                        (targl &gt; n &amp;&amp; force_curry) {
                            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Delegate currying to closures</span>
                            curry_primitive(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, prim, n, targl, args, env, <span style="color: #569cd6;">true</span>)
                        } <span style="color: #569cd6;">else</span> {
                            function(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, args, env)
                        }
                },
            }
        },
        _ =&gt; <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Primitive \"{}\" does not exist"</span>,
                    maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, prim)),
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">gen_arglist</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">n</span>: <span style="color: #4ec9b0;">i64</span>, <span style="color: #9cdcfe;">variadicp</span>: <span style="color: #4ec9b0;">bool</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">list</span> = <span style="color: #569cd6;">if</span> variadicp {
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"rest"</span>)
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #4ec9b0;">Maj</span>::nil()
    };

    <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">_</span> <span style="color: #569cd6;">in</span> 0..n {
        list = <span style="color: #4ec9b0;">Maj</span>::cons(maj_gensym(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state),
                         list.clone());
    }
    list
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">wrap_primitive</span>(<span style="color: #9cdcfe;">prim</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                  <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                  <span style="color: #9cdcfe;">arglist</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit closure &lt;env&gt; &lt;arglist&gt; ((&lt;prim&gt; . &lt;arglist&gt;)))</span>
    <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::closure(),
        env,
        arglist.clone(),
        <span style="color: #c586c0;">maj_list!</span>(
            maj_cons(prim, arglist)))
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">curry_primitive</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>,
                   <span style="color: #9cdcfe;">prim</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                   <span style="color: #9cdcfe;">num_args</span>: <span style="color: #4ec9b0;">i64</span>,
                   <span style="color: #9cdcfe;">num_params</span>: <span style="color: #4ec9b0;">i64</span>,
                   <span style="color: #9cdcfe;">args</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                   <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
                   <span style="color: #9cdcfe;">variadicp</span>: <span style="color: #4ec9b0;">bool</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #569cd6;">if</span> num_params == 0 {
        <span style="color: #569cd6;">return</span> maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(
                <span style="color: #ce9178;">"Cannot curry function without arguments"</span>),
            <span style="color: #4ec9b0;">Maj</span>::nil());
    }

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Currying a primitive function involves generating</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">a wrapper closure, then performing simple application.</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">arglist</span> = gen_arglist(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, num_args, variadicp);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">wrapped</span> = wrap_primitive(prim, env.clone(), arglist);
    maj_apply(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, wrapped, args, env)
}
</pre>
</div>
</div>
</div>
